---
kind: property
id: P:Autodesk.Revit.DB.LineProperties.LineWidth
source: html/0a3f6fee-4ab4-ee50-9eb7-11837da1492b.htm
---
# Autodesk.Revit.DB.LineProperties.LineWidth Property

The current width (thickness) of the pen stroke when drawing lines/curves.

## Syntax (C#)
```csharp
public double LineWidth { get; }
```